Revit 2024 API
BuiltInFailures.OverlapFailures.ToposolidSubregionOverlap Property
 Highlighted toposolid and sub-division overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ToposolidSubregionOverlap { get; }
Visual Basic
Public Shared ReadOnly Property ToposolidSubregionOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ToposolidSubregionOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace